app/controllers/questions_controller.rb

  def index
	@survey = Survey.find(params[:survey_id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def show
    @question = Question.find(params[:id]) # This is not necessary! #@survey = Survey.find(params[:survey_id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def edit
    @survey = Survey.find(params[:survey_id])
    @question = Question.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
SELECT * FROM `questions` WHERE (`questions`.`id` = 5)

  def create
	@survey = Survey.find(params[:survey_id])
    @question = Question.new(params[:question])
	@survey.questions << @question
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
INSERT INTO `questions` (`updated_at`, `title`, `is_commentable`, `description`, `hint`, `is_voteable`, `is_rateable`, `created_at`) VALUES('2010-04-12 05:40:56', 'Quality of Life', 1, 'Does your quality of life match your expectations? Are you comfortable in your living situation, able to enjoy free time and looking forward to tomorrow? ', '', 0, 1, '2010-04-12 05:40:56')

  def update
    @survey = Survey.find(params[:survey_id])
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
SELECT * FROM `questions` WHERE (`questions`.`id` = 5)
UPDATE `questions` SET `hint` = 'no', `description` = 'test3', `updated_at` = '2010-04-13 05:57:05' WHERE `id` = 5

  def rate
    @question = Question.find(params[:id])
    @question.rate(params[:stars], current_user, params[:dimension])

    # update the responses table to make it archievale/versionable?
    response = Response.find(:first, :conditions => [ "user_id = :user_id and question_id = :question_id" , { :user_id=> current_user.id, :question_id => @question.id } ])
    response.rating = params[:stars]
    response.save!
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
SELECT * FROM `responses` WHERE (user_id = 1 and question_id = 2) LIMIT 1
UPDATE `responses` SET `rating` = 7, `updated_at` = '2010-04-22 08:08:21' WHERE `id` = 2