app/controllers/surveys_controller.rb

  def show
    @survey = Survey.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def edit
    @survey = Survey.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save
---
INSERT INTO `surveys` (`category`, `updated_at`, `title`, `description`, `target_audience`, `created_at`) VALUES('review', '2010-04-12 07:58:32', 'Evaluation Form', 'blah', 'employees, managers', '2010-04-12 07:58:32')