app/controllers/survey_sheets_controller.rb

  def show
    if params["id"]

      # SUG: it is not suggested to treate id as definition

      suppose_survey_def_id = params["id"]
      @survey_def = Survey.find(suppose_survey_def_id)
      #@questions = @survey.questions  # TODO: sort by sequence or some columns
      #@answers ||= QuestionAnswerByUser.find(:all, :conditions => { :user_id => self.current_user } )
      #TODO: if @answers are in version, try to load the latest answers

      # get responses, if any, render 'edit'; it not , render 'create'
      # TODO: revise the code to ellaminate the sql queries
      any_responses = Response.find(:first, :conditions => ["user_id = :user_id and survey_sheet_id = :survey_id",
      { :user_id => self.current_user.id,
                                                            :survey_id => suppose_survey_def_id }  ] )

      # INFO: it looks like render does not go through the corresponding method
      if any_responses
        # load survey_sheet
        @survey_sheet = SurveySheet.find(:first,
                                          :conditions => ["user_id = :user_id and survey_id = :survey_id",
        { :user_id => self.current_user.id,
                                                            :survey_id => suppose_survey_def_id }  ] )
        logger.info("------------------------  #{@survey_sheet.responses.size}!")
        logger.info("------------------------survey definition question size:  #{@survey_def.questions.size} ---")
        # if newly create a question for the sheet, no corresponding responses, create one to let user fill in

        existing_questions_ids_in_responses = []
        @survey_sheet.responses.each { | r | existing_questions_ids_in_responses << r.id }
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
SELECT * FROM `responses` WHERE (user_id = 1 and survey_sheet_id = '1') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `survey_sheets` WHERE (user_id = 1 and survey_id = '1') LIMIT 1
SELECT * FROM `survey_sheets` LIMIT 1
SELECT `questions`.* FROM `questions` INNER JOIN survey_question_assignments ON questions.id = survey_question_assignments.question_id WHERE ((`survey_question_assignments`.survey_id = 1))
INSERT INTO `questions` (`updated_at`, `title`, `is_commentable`, `description`, `hint`, `is_voteable`, `is_rateable`, `created_at`) VALUES('2010-04-21 07:06:21', NULL, NULL, NULL, NULL, NULL, NULL, '2010-04-21 07:06:21')
INSERT INTO `responses` (`survey_sheet_id`, `rating`, `updated_at`, `question_id`, `answer_text`, `user_id`, `created_at`) VALUES(1, NULL, '2010-04-21 08:43:25', 1, NULL, 1, '2010-04-21 08:43:25')
INSERT INTO `survey_sheets` (`updated_at`, `title`, `survey_id`, `modification_count`, `user_id`, `created_at`) VALUES('2010-04-21 07:07:53', NULL, NULL, NULL, NULL, '2010-04-21 07:07:53')

  def new
    # parse the parameters hash to create a object
    logger.info "in action create ............."
    if (params.has_key?(:survey_id))
      #Q: if client fake the responses in the params, hwo to avoid those operations?
      # load the survey_sheet and its responses
      @survey_sheet = SurveySheet.new
      survey_template = params[:survey_id]
      survey_def = Survey.find_by_id(survey_template)
      @survey_sheet.survey_id = survey_template
      @survey_sheet.user_id = self.current_user.id
      @survey_sheet.questions << survey_def.questions  # Q: what about the change of survey_def?
      @survey_sheet.save!  # in order to let responses recognize
      @survey_sheet.questions.each do |question|
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
SELECT * FROM `survey_sheets` WHERE (user_id = 1 and survey_id = '1') LIMIT 1
SELECT `questions`.* FROM `questions` INNER JOIN survey_question_assignments ON questions.id = survey_question_assignments.question_id WHERE ((`survey_question_assignments`.survey_id = 1))

    def update
      if (has_survey_responses(params))
        #render :text => "in update, params has responses, so we can parse and update!"
        # * parse and update the survey_sheet and responses, see if we can DRY by doing sth
        #   in helper or rails multiple model updating
        sheet_id = params["survey_sheet_id"]


        @survey_sheet = SurveySheet.find(:first, :conditions => ["user_id = :user_id and survey_id = :survey_id",
        { :user_id => self.current_user.id,
                                                            :survey_id => sheet_id }  ] )

        @survey_sheet.responses.each do | response |
          response.update_attribute(:updated_at ,Time.now)
---
SELECT * FROM `survey_sheets` WHERE (user_id = 1 and survey_id = '1') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `responses` WHERE (`responses`.survey_sheet_id = 1)
UPDATE `responses` SET `answer_text` = '11111111', `updated_at` = '2010-04-22 03:52:39' WHERE `id` = 1

    def index
      @previous_sheets = SurveySheet.find(:all, :conditions => ["user_id = :user_id ",
      { :user_id => self.current_user.id }  ] )
      existing_ids = []
      @previous_sheets.each { |s| existing_ids << s.survey_id }
---
SELECT * FROM `survey_sheets` WHERE (user_id = 1 )
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `surveys`

    def edit
      if params[:id]
        @survey_sheet = SurveySheet.find(:first,
                       :conditions => ["user_id = :user_id and survey_id = :survey_id",
        {     :user_id => self.current_user.id,
              :survey_id => params[:id] }  ] )
---
SELECT * FROM `survey_sheets` WHERE (id = '1' and user_id = 1 ) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1