app/controllers/survey_sheets_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def new
    # parse the parameters hash to create a object
    if (params.has_key?(:survey_id))
      #Q: if client fake the responses in the params, hwo to avoid those operations?
      # load the survey_sheet and its responses

      # test if user has done this survey, not always create a new copy.
      @user_did_sheet = SurveySheet.find(:all, :conditions => ["user_id = :user_id and survey_id = :survey_id",
      { :user_id => self.current_user.id,
        :survey_id => params[:survey_id] }  ])