app/controllers/travel_places_controller.rb

SELECT * FROM `travel_places` WHERE (`travel_places`.`id` = 1)
---
  def index
    @travel_places = TravelPlace.find(:all)

SELECT * FROM `travel_places` WHERE (`travel_places`.`id` = 1)
---
  def show
    @travel_place = TravelPlace.find(params[:id])

INSERT INTO `travel_places` (`name`, `photo`, `created_at`, `updated_at`, `description`) VALUES('ZhangJiaJie', '', '2010-04-01 13:30:44', '2010-04-01 13:30:44', 'a nice play to have leisure day')
---
  def create
    @travel_place = TravelPlace.new(params[:travel_place])

    respond_to do |format|
      if @travel_place.save