app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', 'c1750a7080e0675636c8a6c8df9d47c0c1009ebe', '2010-04-02 02:53:55', 'd4ea30aa89154a61c84ac3b82af110d7a82419b9', NULL, NULL, 'zhujiacheng', 'realalien@gmail.com', '2010-04-02 02:53:55')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `travel_places` WHERE (`travel_places`.`id` = 1)
---
  def vote_for
	   current_user.vote_for(TravelPlace.find(params[:id]))